# Python Exercise

Perform initial data analysis about Movie. Here the dataset is:
• Data Source: IMDB data (Online database of information related to movies)
• Link: https://github.com/scalabretta/GroupProject--IMDB/tree/master/Dataset
• File Name: IMDB-database-update.csv
Open a Jupyter notebook OR Google Collabs, use Python 3 to dig insights more less about the followings:

In [7]:
import pandas as pd
imdblocal = pd.read_csv('D:\Data Science Bootcamp\Day 3\IMDB-database-update.csv', encoding='latin1')

1. How many rows and columns reflected on dataset file IMDB-database-update.csv?
<br> *__There are 3,781 rows (including header) and 36 columns__*

In [9]:
imdblocal.shape

(3781, 36)

2. What are the top 3 movies with highest nett profit in 2015?
<br> *__Jurassic World, Minions, Avengers: Age of Ultron__*

In [33]:
imdblocal[imdblocal['title_year']==2015][['movie_title', 'title_year','net_USD']].sort_values(by=['net_USD'], ascending=False)[0:3].reset_index(drop=True)

               movie_title  title_year    net_USD
0           Jurassic World        2015  502177271
1                  Minions        2015  262029560
2  Avengers: Age of Ultron        2015  208991599

3. What are the top 3 movies with highest gross profit in 2016?
<br> *__Jurassic World, Minions, Inside Out__*

In [40]:
imdblocal[imdblocal['title_year']==2015][['movie_title', 'title_year','gross_USD']].sort_values(by=['gross_USD'], ascending=False)[0:3].reset_index(drop=True)

               movie_title  title_year  gross_USD
0           Jurassic World        2015  652177271
1  Avengers: Age of Ultron        2015  458991599
2               Inside Out        2015  356454367

4. How many non-english movies are in the dataset?
<br> *__152 movies__*

In [55]:
imdb_mod = imdblocal.drop_duplicates(subset = 'movie_title')
imdb_mod[imdb_mod['language']!="English"]['movie_title'].count()

152

5. What are top 3 languages in the data set aside English (based on number of movies)?
<br> *__French, Spanish, Mandarin__*

In [67]:
imdb_mod[imdb_mod['language']!="English"]['language'].value_counts()[0:3]

French      33
Spanish     23
Mandarin    13
Name: language, dtype: int64

6. What are the top 3 countries with the highest nett profit in all dataset times?
<br> *__USA, UK, Canada__*

In [90]:
imdb_mod.groupby(['country'])['country', 'net_USD'].sum().sort_values(by=['net_USD'], ascending=False)[0:3].reset_index()

  country      net_USD
0     USA  50330300012
1      UK   1279724445
2  Canada    232040577

7. What are the average budget of all movies in dataset in 2015?
<br> *__52102458.333333336__*

In [96]:
imdb_mod[imdb_mod['title_year']==2015]['budget_USD'].mean()

52102458.333333336

8. What are the average budget of all movies in dataset in 2016?
<br> *__66014754.09836066__*

In [97]:
imdb_mod[imdb_mod['title_year']==2016]['budget_USD'].mean()

66014754.09836066

9. Which one is higher, average budget of all movies in dataset in 2015 or 2016?
<br> *__Average budget of all movies in 2016 is higher than 2016__*

10. What movie that resulted highest nett profit of all dataset times? How much did the movie make?
<br> *__The movie with the highest nett profit of all dataset times is Avater with profit of USD 523,505,847__*

In [111]:
imdb_mod[['movie_title', 'net_USD']].sort_values(by=['net_USD'], ascending=False)[:1].reset_index(drop=True)

  movie_title    net_USD
0      Avatar  523505847